In [13]:
import pandas as pd
df = pd.read_csv('../csv_data/Demesne.csv')

df

              TEXT   X1   Y1   X2   Y2  block_no  line_no
0          INVOICE  488   20  559   42         0        0
1          DEMESNE   19   21   78   38         0        1
2       ELECTRICAL   81   21  156   38         0        1
3            SALES  159   21  197   38         0        1
4              LTD  200   21  224   38         0        1
..             ...  ...  ...  ...  ...       ...      ...
260        Account   48  802   81  814        60        0
261              :   83  802   86  814        60        0
262       83020698   89  802  130  814        60        0
263           Sort  132  802  149  814        60        0
264  Code:90-13-43  152  802  212  814        60        0

[265 rows x 7 columns]

In [14]:
df_sort= df.sort_values('Y1',ascending = True).reset_index(drop=True)
df_sort

              TEXT   X1   Y1   X2   Y2  block_no  line_no
0          INVOICE  488   20  559   42         0        0
1          DEMESNE   19   21   78   38         0        1
2       ELECTRICAL   81   21  156   38         0        1
3            SALES  159   21  197   38         0        1
4              LTD  200   21  224   38         0        1
..             ...  ...  ...  ...  ...       ...      ...
260        Account   48  802   81  814        60        0
261              :   83  802   86  814        60        0
262       83020698   89  802  130  814        60        0
263           Sort  132  802  149  814        60        0
264  Code:90-13-43  152  802  212  814        60        0

[265 rows x 7 columns]

In [15]:
def find_text(temp_df, text,case=False):
    location = temp_df[temp_df['TEXT'].str.contains(text,case=case, na=False)].index.tolist()
    return location

def find_next_word(temp_df, text, nearest_text, case=False):
    pos = find_text(temp_df,text,case=case)
    pos = [item +1 for item in pos]
#     print(pos)
    new_pos = list()
    for item in pos:
#         temp = df.loc[]
        temp_value= temp_df.loc[item]['TEXT']
#         print(temp_value.lower())
       
        if temp_value.lower().__contains__(nearest_text.lower()):
            new_pos.append(item-1)
        
    return new_pos

In [16]:
pos = find_text(df,'Invoice')

df[pos[2]:pos[2]+4]
# invoice_no = df[pos[0]+2:pos[0]+3]['TEXT'].values[0]

       TEXT   X1   Y1   X2   Y2  block_no  line_no
40  Invoice  380   95  410  106        12        0
41   Number  412   95  444  106        12        0
42  Account  380  104  412  115        12        1
43   Number  415  104  447  115        12        1

In [17]:
pos_date =find_text(df_sort,'date')[0]
date = df_sort[pos_date+1:pos_date+2]['TEXT'].values[0]
date

'12/04/2022'

In [18]:
find_text(df,'VAT')

[93, 222, 228, 233]

In [19]:
find_text(df,'Anbalysis')

[]

In [20]:
find_next_word(df,'VAT','Analysis')

[228]

In [22]:
table_start = find_next_word(df, 'Unit','Price')
print(table_start)
table_end = find_next_word(df, 'VAT', 'Analysis')
print(table_end)
table_data = df[table_start[0]:table_end[0]-25]
table_data

[50]
[228]

         TEXT   X1   Y1   X2   Y2  block_no  line_no
50       Unit  405  328  422  339        15        3
51      Price  424  328  445  339        15        3
52     Amount  518  328  550  339        15        4
53   Products  212   75  243   86        16        0
54     remain  245   75  270   86        16        0
..        ...  ...  ...  ...  ...       ...      ...
198  (B00846)  321  469  354  480        40        2
199  14.05934  414  469  447  480        40        3
200     84.35  534  469  554  480        40        4
201    25.00%  476  469  504  480        40        5
202        36   46  484   55  495        41        0

[153 rows x 7 columns]

In [10]:
from pprint import pprint
msg = dict()
result = list()
for index, row in table_data.iterrows():
    if row['X1'] < 50: 
        msg = dict()
        print(row['TEXT'])
        msg['item'] = row['TEXT']
        msg['desc'] = ''
    if ('item' in msg) and (130 < row['X1'] < 250):
        print(row['TEXT'])
        msg['desc'] = msg['desc'] +" "+ row['TEXT']
        msg['qty'] = ''
    if 'qty' in msg and 420 < row['X1'] < 435:
        
        msg['qty'] = row['TEXT']
        msg['unit'] = 0
    if 'unit' in msg and 440  < row['X1'] < 480:
        msg['unit'] = row['TEXT']
        msg['total'] = 0
    if 'total' in msg and 480 < row['X1'] < 530:
        print(row['TEXT'])
        msg['total'] = row['TEXT']
        pprint(msg)
        result.append(msg)

NameError: name 'table_data' is not defined

In [11]:
pos_good = find_text(df, 'Goods', case=True)
pos_good

[]

In [12]:
pos_vat = find_text(df, 'V.A.T', case=True)
pos_vat

[247]

In [32]:
good_value = df[pos_good[1]+1:pos_good[1]+2]['TEXT'].values[0]

In [33]:
vat_value = df[pos_vat[1]+1:pos_vat[1]+2]['TEXT'].values[0]

In [34]:
vat_value

'€327.94'

In [38]:
pos_total = find_text(df,'Total', True)[0]
pos_total

130

In [43]:
total_value = df[pos_total+1:pos_total+2]['TEXT'].values[0]

In [44]:
total_value

'€1753.76'

         TEXT   X1   Y1   X2   Y2  block_no  line_no
131  €1753.76  512  605  552  616        21        1